from ..base.StructureRearranger import StructureRearranger
from im.gear import Operator

class BSStructureRearranger(StructureRearranger):
	def getPatternList(self):
		return [
			("({運算=鴻} ({名稱=彳}) ({運算=範算} ({名稱=山}) ({名稱=一}) .*) .*)", "(龍 [特微] 丨 \\5 \\6)"),
			("({運算=鴻} ({名稱=行.0}) ({名稱=[䘗中]}) .*)", "(龍 [特微] 丨 糸 \\3 )"),

			("({運算=範廖} ({名稱=厂}) ({名稱=[辰下]}) )", "(龍 [厂一] [畏下])"),
			("({運算=範廖} ({名稱=厂}) ({名稱=[一幺]}) )", "(龍 [厂一] 幺)"),

			("({運算=範湘} ({名稱=儿.0}) .* ({名稱=儿.1}) )", "(龍 儿 \\2)"),
			("({運算=範湘} ({名稱=[丨丨].0}) .* ({名稱=[丨丨].1}) )", "(龍 [丨丨] \\2)"),
			("({運算=範湘} ({名稱=[丨丿].0}) .* ({名稱=[丨丿].1}) )", "(龍 [丨丿] \\2)"),
			("({運算=範湘} ({名稱=[丿丨].0}) .* ({名稱=[丿丨].1}) )", "(龍 [丿丨] \\2)"),
		]

