from ..base.StructureRearranger import StructureRearranger
from im.gear import Operator
from gear import TreeRegExp

class ARStructureRearranger(StructureRearranger):
	def getPatternList(self):
		return [
			("({運算=鴻} ({名稱=彳}) ({運算=範算} ({名稱=山}) ({名稱=一}) .*) .*)", "(龍 [特微] \\5 \\6)"),
			("({運算=鴻} ({名稱=行.0}) ({名稱=[䘗中]}) .*)", "(龍 [特微] 糸 \\3 )"),

			("({運算=範載} ({名稱=戈}) ({名稱=口}) )", "(龍 [一口] [特戈])"),
			("({運算=範載} ({名稱=戈}) ({名稱=[口一]}) )", "(龍 [一口] 一 [特戈])"),
			("({運算=範載} ({名稱=戈}) ({名稱=呈}) )", "(龍 [一口] 王 [特戈])"),
			("({運算=範載} ({名稱=戈}) ({名稱=[口天]}) )", "(龍 [一口] 天 [特戈])"),
			("({運算=範載} ({名稱=戈}) ({名稱=[特㦽]}) )", "(龍 [一口] [一巛] [特戈])"),
			("({運算=範同} ({名稱=戌}) ({名稱=口}) )", "(龍 厂 [一口] [特戈])"),
			("({運算=蚕} .* ({名稱=一}) ({名稱=口}) .*)", "(蚕 \\1 [一口] \\4)"),
			("({運算=蚕} ({名稱=旦}) ({名稱=黾}) .*)", "(蚕 日 [一口] 电 \\3)"),
			("({運算=蚕} ({名稱=一}) ({名稱=[口㐄]}) .*)", "(蚕 [一口] 㐄 \\3)"),
			("({運算=蚕} ({名稱=士}) ({名稱=冖}) .*)", "(蚕 [士冖] \\3)"),


			("({運算=範湘} ({名稱=儿.0}) .* ({名稱=儿.1}) )", "(範湘 丨 \\2 乚)"),
			("({運算=範湘} ({名稱=[丨丨].0}) .* ({名稱=[丨丨].1}) )", "(範湘 丨 \\2 丨)"),
			("({運算=範湘} ({名稱=[丨丿].0}) .* ({名稱=[丨丿].1}) )", "(範湘 丨 \\2 丿)"),
			("({運算=範湘} ({名稱=[丿丨].0}) .* ({名稱=[丿丨].1}) )", "(範湘 丨 \\2 丨)"),
			]

